app/controllers/listings_controller.rb

  def index
    @listing = Listing.all
---
SELECT "listings".* FROM "listings"

  def create
    @listing = Listing.new(listing_params)
    if @listing.save
---
INSERT INTO "listings" ("name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hut3"], ["location", "oxford"], ["created_at", 2017-07-02 10:44:12 UTC], ["updated_at", 2017-07-02 10:44:12 UTC]]

  def destroy
		@listing = Listing.find(params[:id])
		@listing.destroy
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 4]]

  def show
    @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]